---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeMisalignedUnConnError
source: html/4e914f02-3132-7527-8894-74530de6aae6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeMisalignedUnConnError Property

The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type has a problem with the angle dimension of the current fitting(s), resulting in bad geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartCannotChangeTypeMisalignedUnConnError { get; }
```